// Створіть строку та виведіть її в консоль:
// Компанію "Об'єкт" визнано банкрутом.
// Реквізити: АУ\\3277085.

(function task1(){

	let str = '"Об\'єкт" визнано банкрутом.\nРеквізити: АУ\\\\3277085.';

	console.log(str);

})();

// Створіть 2 строки з вашими ім'ям та прізвищем.
// Створіть функцію, що повертає строку: ім'я та прізвище, кома і кількість символів (без пробіла).
// Використайте функцію, задавши їй дві створені змінні, виведіть результат в консоль:
// Бобир Олександр, 14 символів

(function task2(){

	let surname = "Стасишина";
	let name = "Наталія";

	console.log(fun(surname,name));

	function fun(s,n){
		let res = s+" "+n+", "+(s.length+n.length)+" символів";
		return res;
	}	

})();

// Дано телефон в форматі "0682091234". Потрібно його перетворити у формат "+38 (068) 209-12-34".
// Створіть функцію, яка виконує цю задачу.

(function task3(){

	let number = "0682091234";

	console.log(formatNumber(number));

	function formatNumber(num){
		res = "+38 ("+num.slice(0,3)+") "+num.slice(3,6)+"-"+num.slice(6,8)+"-"+num.slice(8,10);
		return res;
	}

})();

// Задайте у змінну своє ім'я. Виведіть його повідомленням на екран у верхньому та нижньому регістрах.

(function task4(){

	let name = "Наташа";

	alert(name.toUpperCase());
	alert(name.toLowerCase());

})();

// Виведіть в консоль індекс букви "ї" в стрічці "Ми приїхали в Запоріжжя".

(function task5(){

	let str = "Ми приїхали в Запоріжжя";

	console.log(str.indexOf("ї"));

})();

// Розбийте цю стрічку на окремі слова та виведіть масив в консоль.

(function task6(){

	let str = "Ми приїхали в Запоріжжя";

	console.log(str.split(" "));

})();

// Виведіть в консоль підстроку з 6 по 20 символ включно;
// виведіть в консоль підстроку починаючи з 3 символа, довжиною 8 символів;
// виведіть в консоль підстроку починаючи з букви ї до пробіла, не включаючи його.


(function task7(){

	let str = "Ми приїхали в Запоріжжя";

	console.log(str.split(" "));

	console.log(str.substring(6,21));

	console.log(str.substr(3,8));

	console.log(str.substring(str.indexOf("ї"),str.indexOf(" ",str.indexOf("ї"))));

})();

// Задайте у дві змінні ваші ім'я та прізвище.
// Створіть функцію, що повертає строку, яка починається з перших трьох символів вашого імені та останніх трьох символів прізвища.
// Результат виведіть в консоль.

(function task8(){

	let surname = "Стасишина";
	let name = "Наталія";

	console.log(f(surname,name));

	function f(s,n){
		return n.slice(0,3)+s.slice(-3);
	}

})();